[
    {
      "name": "Python",
      "description": "Python — это высокоуровневый язык программирования общего назначения, который широко используется для разработки веб-приложений, анализа данных, искусственного интеллекта и др.",
      "popularity": 95.83,
      "rating": 4.95
    },
    {
      "name": "Django",
      "description": "Django — это мощный веб-фреймворк для Python, который позволяет быстро создавать безопасные и масштабируемые веб-приложения.",
      "popularity": 90.12,
      "rating": 4.85
    },
    {
      "name": "JavaScript",
      "description": "JavaScript — это язык программирования, используемый для создания интерактивных веб-страниц и веб-приложений.",
      "popularity": 97.45,
      "rating": 4.9
    },
    {
      "name": "React",
      "description": "React — это библиотека JavaScript для создания пользовательских интерфейсов, разработанная Facebook.",
      "popularity": 94.32,
      "rating": 4.88
    },
    {
      "name": "Node.js",
      "description": "Node.js — это среда выполнения JavaScript на стороне сервера, позволяющая создавать масштабируемые сетевые приложения.",
      "popularity": 89.67,
      "rating": 4.8
    },
    {
      "name": "TypeScript",
      "description": "TypeScript — это строго типизированный язык программирования, расширяющий JavaScript и улучшающий разработку крупных приложений.",
      "popularity": 88.15,
      "rating": 4.82
    },
    {
      "name": "Java",
      "description": "Java — это популярный объектно-ориентированный язык программирования, используемый для разработки корпоративных приложений и Android-приложений.",
      "popularity": 85.74,
      "rating": 4.7
    },
    {
      "name": "Spring Boot",
      "description": "Spring Boot — это фреймворк для Java, упрощающий создание автономных, готовых к производству приложений.",
      "popularity": 82.56,
      "rating": 4.75
    },
    {
      "name": "C#",
      "description": "C# — это язык программирования от Microsoft, используемый для разработки приложений на платформе .NET, игр (Unity) и др.",
      "popularity": 80.23,
      "rating": 4.65
    },
    {
      "name": "ASP.NET Core",
      "description": "ASP.NET Core — это кроссплатформенный фреймворк для создания веб-приложений и API от Microsoft.",
      "popularity": 78.91,
      "rating": 4.68
    },
    {
      "name": "Go (Golang)",
      "description": "Go — это язык программирования от Google, известный своей простотой, производительностью и поддержкой многопоточности.",
      "popularity": 83.47,
      "rating": 4.78
    },
    {
      "name": "Kubernetes",
      "description": "Kubernetes — это система оркестрации контейнеров, позволяющая автоматизировать развертывание, масштабирование и управление приложениями.",
      "popularity": 86.34,
      "rating": 4.83
    },
    {
      "name": "Docker",
      "description": "Docker — это платформа для разработки, доставки и запуска приложений в контейнерах.",
      "popularity": 91.28,
      "rating": 4.87
    },
    {
      "name": "PostgreSQL",
      "description": "PostgreSQL — это мощная реляционная СУБД с открытым исходным кодом, поддерживающая расширенные функции и масштабируемость.",
      "popularity": 87.59,
      "rating": 4.79
    },
    {
      "name": "MongoDB",
      "description": "MongoDB — это документоориентированная NoSQL-база данных, используемая для работы с большими объемами данных.",
      "popularity": 84.21,
      "rating": 4.72
    },
    {
      "name": "Redis",
      "description": "Redis — это хранилище данных типа «ключ-значение» в памяти, часто используемое для кэширования и работы с реальным временем.",
      "popularity": 81.45,
      "rating": 4.74
    },
    {
      "name": "TensorFlow",
      "description": "TensorFlow — это библиотека машинного обучения от Google, используемая для разработки нейронных сетей и AI-приложений.",
      "popularity": 79.88,
      "rating": 4.71
    },
    {
      "name": "PyTorch",
      "description": "PyTorch — это фреймворк для машинного обучения, разработанный Facebook, известный своей гибкостью и удобством.",
      "popularity": 83.12,
      "rating": 4.77
    },
    {
      "name": "Flutter",
      "description": "Flutter — это фреймворк от Google для создания кроссплатформенных мобильных и веб-приложений с использованием Dart.",
      "popularity": 85.63,
      "rating": 4.76
    },
    {
      "name": "Rust",
      "description": "Rust — это язык программирования, обеспечивающий безопасность памяти и высокую производительность, часто используемый в системном программировании.",
      "popularity": 82.94,
      "rating": 4.81
    }
  ]